Revit 2027 API
AnalyticalElement.GetReference Method
 Returns a reference to a given curve within the Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetReference(
	AnalyticalModelSelector selector
)
Public Function GetReference (
	selector As AnalyticalModelSelector
) As Reference
public:
Reference^ GetReference(
	AnalyticalModelSelector^ selector
)
member GetReference :
        selector : AnalyticalModelSelector -> Reference
Parameters
selector AnalyticalModelSelector
 Specifies where in the Analytical Element the reference lies.
Return Value
Reference
 Requested reference.
Exceptions
Exception | Condition
ArgumentException |  selector is not valid for this AnalyticalElement.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace